In [1]:
import pandas as pd 
import numpy as np

In [2]:
dias = pd.date_range(start='20190101', periods=12)
dias

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10', '2019-01-11', '2019-01-12'],
              dtype='datetime64[ns]', freq='D')

In [3]:
Pessoa = ['George','Victor','Lucas']
np.random.choice(Pessoa)

np.str_('Lucas')

In [9]:
Nome=[]
Gasto=[]
for i in range(12):
    Nome.append(np.random.choice(Pessoa))
    Gasto.append(np.round(np.random.random()*100,2))
Nome
Gasto

[np.float64(97.12),
 np.float64(20.39),
 np.float64(37.64),
 np.float64(94.2),
 np.float64(26.49),
 np.float64(58.58),
 np.float64(98.33),
 np.float64(82.29),
 np.float64(27.38),
 np.float64(82.24),
 np.float64(63.64),
 np.float64(34.66)]

In [11]:
df = pd.DataFrame({'Dia': dias, 'Nome': Nome, 'Gasto': Gasto})
df

          Dia    Nome  Gasto
0  2019-01-01  George  97.12
1  2019-01-02   Lucas  20.39
2  2019-01-03  George  37.64
3  2019-01-04  Victor  94.20
4  2019-01-05  George  26.49
5  2019-01-06   Lucas  58.58
6  2019-01-07  George  98.33
7  2019-01-08  Victor  82.29
8  2019-01-09   Lucas  27.38
9  2019-01-10   Lucas  82.24
10 2019-01-11  Victor  63.64
11 2019-01-12  George  34.66

In [13]:
df.pivot(index='Dia',columns='Nome', values='Gasto')
df

          Dia    Nome  Gasto
0  2019-01-01  George  97.12
1  2019-01-02   Lucas  20.39
2  2019-01-03  George  37.64
3  2019-01-04  Victor  94.20
4  2019-01-05  George  26.49
5  2019-01-06   Lucas  58.58
6  2019-01-07  George  98.33
7  2019-01-08  Victor  82.29
8  2019-01-09   Lucas  27.38
9  2019-01-10   Lucas  82.24
10 2019-01-11  Victor  63.64
11 2019-01-12  George  34.66